-- phpMyAdmin SQL Dump
-- version 4.4.4
-- http://www.phpmyadmin.net
--
-- Хост: localhost
-- Время создания: Апр 12 2016 г., 15:19
-- Версия сервера: 5.5.43-MariaDB
-- Версия PHP: 5.5.26

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8 */;

--
-- База данных: `comments`
--

-- --------------------------------------------------------

--
-- Структура таблицы `comments`
--

CREATE TABLE IF NOT EXISTS `comments` (
  `id` int(10) unsigned NOT NULL,
  `text` text NOT NULL,
  `who_comment` varchar(255) NOT NULL,
  `add_date` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP,
  `order_level_main` int(10) unsigned NOT NULL DEFAULT '0',
  `order_level_1` int(10) unsigned DEFAULT '0',
  `order_level_2` int(10) unsigned NOT NULL DEFAULT '0',
  `order_level_3` int(10) unsigned NOT NULL DEFAULT '0'
) ENGINE=InnoDB AUTO_INCREMENT=37 DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `comments`
--

INSERT INTO `comments` (`id`, `text`, `who_comment`, `add_date`, `order_level_main`, `order_level_1`, `order_level_2`, `order_level_3`) VALUES
(1, 'коммент 1', 'юзер 1', '2016-04-07 21:00:00', 1, 0, 0, 0),
(2, 'коммент 2', 'юзер 2', '2016-04-07 22:00:00', 2, 0, 0, 0),
(3, 'коммент 3', 'юзер 3', '2016-04-07 23:00:00', 3, 0, 0, 0),
(4, 'ком 4', 'юзер 4', '2016-04-08 12:39:00', 4, 0, 0, 0),
(5, 'коммент 5', 'юзер 5', '2016-04-08 13:00:40', 5, 0, 0, 0),
(6, 'коммент 6', 'юзер 6', '2016-04-11 10:33:35', 6, 0, 0, 0),
(7, 'коммент 7', 'юзер 7', '2016-04-11 10:37:56', 7, 0, 0, 0),
(8, 'коммент 8', 'юзер 7', '2016-04-11 10:41:03', 8, 0, 0, 0),
(9, 'коммент 9', 'юзер 7', '2016-04-11 10:41:37', 9, 0, 0, 0),
(10, 'коммент 8-1', 'юзер 1', '2016-04-12 08:39:21', 8, 10, 0, 0),
(11, 'коммент 10', 'юзер 10', '2016-04-12 08:54:41', 11, 0, 0, 0),
(12, 'коммент 11', 'юзер 11', '2016-04-12 09:04:12', 12, 0, 0, 0),
(13, 'коммент 12', 'юзер 12', '2016-04-12 09:06:33', 13, 0, 0, 0),
(14, 'коммент 12-1', 'юзер 1', '2016-04-12 09:06:56', 13, 14, 0, 0),
(15, 'rком 13', 'юзер 13', '2016-04-12 10:16:58', 15, 0, 0, 0),
(16, 'ком 16', 'ю 16', '2016-04-12 10:33:21', 16, 0, 0, 0),
(17, 'ком 17', 'ю 17', '2016-04-12 10:34:27', 17, 0, 0, 0),
(18, 'ком 18', 'ю 18', '2016-04-12 10:39:58', 18, 0, 0, 0),
(19, 'ком19', 'ю 19', '2016-04-12 10:40:09', 19, 0, 0, 0),
(20, 'ком 18-1', 'ю 1', '2016-04-12 10:40:47', 18, 20, 0, 0),
(21, 'ком 18-1-1', 'ю 2', '2016-04-12 10:42:16', 18, 20, 21, 0),
(22, 'ком 18-1-1-1', 'ю3', '2016-04-12 10:45:15', 18, 20, 21, 22),
(23, 'кком 19-1', 'ю 1', '2016-04-12 10:46:03', 19, 23, 0, 0),
(24, 'ком 10-1', 'ю 1', '2016-04-12 10:47:47', 11, 24, 0, 0),
(25, 'ком 2-1', 'ю 1', '2016-04-12 10:53:37', 2, 25, 0, 0),
(26, 'ком 20', 'ю 4', '2016-04-12 10:53:58', 26, 0, 0, 0),
(27, 'ком 20-1', 'ю 3', '2016-04-12 10:54:13', 26, 27, 0, 0),
(28, 'ком 20-1-1', 'ю 16', '2016-04-12 10:54:25', 26, 27, 28, 0),
(29, 'ком 20-2', 'ю 2', '2016-04-12 10:54:35', 26, 29, 0, 0),
(30, 'ком 20-1-1-1', 'ю 4', '2016-04-12 10:54:56', 26, 27, 28, 30),
(31, 'ком 20-1-1-2', 'ю 5', '2016-04-12 10:57:03', 26, 27, 28, 31),
(32, 'ком 5-1', 'ю 5', '2016-04-12 12:07:39', 5, 32, 0, 0),
(33, 'ком 9-1', 'ю 6', '2016-04-12 12:09:00', 9, 33, 0, 0),
(34, 'ком 9-2', 'ю 5', '2016-04-12 12:11:43', 9, 34, 0, 0),
(35, 'ком 5-2', 'ю 6', '2016-04-12 12:12:28', 5, 35, 0, 0),
(36, 'ком7-1', 'ю 4', '2016-04-12 12:13:26', 7, 36, 0, 0);

--
-- Индексы сохранённых таблиц
--

--
-- Индексы таблицы `comments`
--
ALTER TABLE `comments`
  ADD PRIMARY KEY (`id`);

--
-- AUTO_INCREMENT для сохранённых таблиц
--

--
-- AUTO_INCREMENT для таблицы `comments`
--
ALTER TABLE `comments`
  MODIFY `id` int(10) unsigned NOT NULL AUTO_INCREMENT,AUTO_INCREMENT=37;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
